[...document.querySelectorAll('.toLangRep')].filter(e=>e.getAttribute('lang')==localStorage.getItem('nobleLang')).forEach(e=>{
    e.classList.remove('hidden')
})

document.querySelectorAll('.toRep3').forEach(e=>{
    e.href = e.href + `&lang=${localStorage.getItem('nobleLang')}`
})

if(localStorage.getItem('nobleLang')=='ar'){
    let ca = [
        `تقدم دهانات نوبل منتجات عالية الجودة في مجال الديكور والمباني الانشائية والمعمارية التي تحتوي على مركبات عضوية منخفضة التطاير (VOC) وهي صديقة للبيئة داخلية وخارجية ذو تأثير مضاد للفطريات و البكتيريا مع أيونات الفضة النشطة التي تقتل جميع البكتيريا والفطريات وتستخدم في المستشفيات والفلل الخاصة والفنادق`,
        `نوبل طلاء سيارات اكرليك عبارة عن عملية طلاء عالية الجودة للمركبات ، تعمل بنظام مصمم خصيصًا والذي ينتج مع مجموعة من ألوان RAL و BS المطبقة على جميع أنواع السيارات حول العالم ، يأتي النظام مزودًا بمقويات ومخففات ومجففات و اساسات وطبقات علوية لتلبية جميع متطلبات التطبيق.`,
        `تم تصميم مجموعة منتجات الدهانات الصناعية الواسعة لمختلف الاحتياجات الصناعية وهي متوفرة مثل الدهانات الايبوكسي والبولي يوريثين والزنك وراتنجات الألكيد التي يمكن استخدامها في مصانع النفط والغاز و البراميل  والبتروكيماويات.  تشمل الاستخدامات الأخرى الهياكل الفولاذية والخزانات والسقالات والمنشآت البحرية.`,
        `دهانات الحماية مصنوعة خصيصاً بمعايير دولية للحماية من التآكل والصدأ والرطوبة والقلويات والمياه المالحة في المناطق البحرية.  يتم استخدامها في طلاء السفن والقوارب والموانئ والهياكل الحديدية والجسور الثابتة في البحر.`,
        `نوبل دهانات الاخشاب عالية الحودة وسريعة الجفاف وسهلة التطبيق على الأسطح الخشبية ، متوفرة بمجموعة متنوعة ويوفر رؤية جديدة للأسطح الخشبية مع اختراق ممتاز وحماية الخشب.  يمكن طلاء صبغة الاخشاب باستخدام البولي يوريثين و النيتروسليلوز الشفاف و اليونيفيرسال .`,
        `طلاء الأرضيات وعلامات الطرق تمتلك دهانات نوبل مجموعة واسعة من الطلاءات القائمة على الإيبوكسي والأكريليك والبولي يوريثين لتناسب مجالات التطبيق المختلفة.  الحفاظ على البيئة كأولوية رئيسية وطورت دهانات نوبل إيبوكسي قائم على الماء خالٍ من المذيبات يستخدم في مختلف المناطق التي يمكن المرور عليها مثل طلاء مواقف السيارات والأرضيات الصناعية والطرق والمستودعات .`,
        `توفر دهانات نوبل منتج البودر كوتينج ذو تغطية فائقة ويمكن استخدامها لطلاء الصلب والألمنيوم للأعمال المعمارية والأثاث وقطع غيار السيارات والمكونات الكهربائية  تشطيبًا متينًا وموحدًا على الأسطح ذات الصلة. بودر كوتينج خالي من المذيبات مع عدم وجود المركبات العضوية المتطايرة و الخطرة مما يجعله منتجًا صديقًا للبيئة`,
        `تماشيًا مع متطلبات السوق الصناعي طورت نوبل قسمًا خاصًا لتصنيع جميع أنواع الغراء لخدمة مصانع الخشب والكرتون والأثاث ولأننا مهتمون بالبيئة فقد أنتجنا مواد خالية من المذيبات و مواد صديقة للبيئة`,
        `إلى جانب الدهانات توفر نوبل التنرات المخففه للطلاء بجميع انواعها مثل الثنر الناري والبلوريثان والأيبوكسي والاكرليك`,
    ]
    document.querySelectorAll('.text5').forEach((e,i)=>{
        e.innerHTML = ca [i]
    })
}